; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	infrared2 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 194)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 148)
	(= (data Planet3 thermograph1) 56)
	(= (data Planet4 thermograph1) 81)
	(= (data Planet5 thermograph1) 216)
	(= (data Planet6 thermograph1) 280)
	(= (data Phenomenon7 thermograph1) 236)
	(= (data Planet3 spectrograph0) 255)
	(= (data Planet4 spectrograph0) 188)
	(= (data Planet5 spectrograph0) 228)
	(= (data Planet6 spectrograph0) 106)
	(= (data Phenomenon7 spectrograph0) 127)
	(= (data Planet3 infrared2) 120)
	(= (data Planet4 infrared2) 223)
	(= (data Planet5 infrared2) 200)
	(= (data Planet6 infrared2) 171)
	(= (data Phenomenon7 infrared2) 129)
	(= (slew_time Star2 Star0) 52.11)
	(= (slew_time Star0 Star2) 52.11)
	(= (slew_time Star2 GroundStation1) 34.76)
	(= (slew_time GroundStation1 Star2) 34.76)
	(= (slew_time GroundStation1 Star0) 7.366)
	(= (slew_time Star0 GroundStation1) 7.366)
	(= (slew_time Planet3 Star0) 20.17)
	(= (slew_time Star0 Planet3) 20.17)
	(= (slew_time Planet3 GroundStation1) 56.75)
	(= (slew_time GroundStation1 Planet3) 56.75)
	(= (slew_time Planet3 Star2) 66.57)
	(= (slew_time Star2 Planet3) 66.57)
	(= (slew_time Planet4 Star0) 3.928)
	(= (slew_time Star0 Planet4) 3.928)
	(= (slew_time Planet4 GroundStation1) 21.48)
	(= (slew_time GroundStation1 Planet4) 21.48)
	(= (slew_time Planet4 Star2) 60.01)
	(= (slew_time Star2 Planet4) 60.01)
	(= (slew_time Planet4 Planet3) 5.063)
	(= (slew_time Planet3 Planet4) 5.063)
	(= (slew_time Planet5 Star0) 0.8324)
	(= (slew_time Star0 Planet5) 0.8324)
	(= (slew_time Planet5 GroundStation1) 50.06)
	(= (slew_time GroundStation1 Planet5) 50.06)
	(= (slew_time Planet5 Star2) 65.91)
	(= (slew_time Star2 Planet5) 65.91)
	(= (slew_time Planet5 Planet3) 26.95)
	(= (slew_time Planet3 Planet5) 26.95)
	(= (slew_time Planet5 Planet4) 21.27)
	(= (slew_time Planet4 Planet5) 21.27)
	(= (slew_time Planet6 Star0) 57.28)
	(= (slew_time Star0 Planet6) 57.28)
	(= (slew_time Planet6 GroundStation1) 11.46)
	(= (slew_time GroundStation1 Planet6) 11.46)
	(= (slew_time Planet6 Star2) 10.87)
	(= (slew_time Star2 Planet6) 10.87)
	(= (slew_time Planet6 Planet3) 9.354)
	(= (slew_time Planet3 Planet6) 9.354)
	(= (slew_time Planet6 Planet4) 21.35)
	(= (slew_time Planet4 Planet6) 21.35)
	(= (slew_time Planet6 Planet5) 44.76)
	(= (slew_time Planet5 Planet6) 44.76)
	(= (slew_time Phenomenon7 Star0) 51.11)
	(= (slew_time Star0 Phenomenon7) 51.11)
	(= (slew_time Phenomenon7 GroundStation1) 9.615)
	(= (slew_time GroundStation1 Phenomenon7) 9.615)
	(= (slew_time Phenomenon7 Star2) 46.7)
	(= (slew_time Star2 Phenomenon7) 46.7)
	(= (slew_time Phenomenon7 Planet3) 4.542)
	(= (slew_time Planet3 Phenomenon7) 4.542)
	(= (slew_time Phenomenon7 Planet4) 27.51)
	(= (slew_time Planet4 Phenomenon7) 27.51)
	(= (slew_time Phenomenon7 Planet5) 6.504)
	(= (slew_time Planet5 Phenomenon7) 6.504)
	(= (slew_time Phenomenon7 Planet6) 43.25)
	(= (slew_time Planet6 Phenomenon7) 43.25)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet3 thermograph1)
	(have_image Planet5 spectrograph0)
	(have_image Planet6 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 planet4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 148 to 87.99, (fuel-used) from 0 to 60.01
   goals met: 0 of 3
2. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 194 to 182.54, (fuel-used) from 60.01 to 71.47
   goals met: 0 of 3
3. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 87.99 to 84.062, (fuel-used) from 71.47 to 75.398
   goals met: 0 of 3
4. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 84.062 to 80.134, (fuel-used) from 75.398 to 79.326
   goals met: 0 of 3
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
6. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 80.134 to 76.206, (fuel-used) from 79.326 to 83.254
   goals met: 0 of 3
7. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 76.206 to 72.278, (fuel-used) from 83.254 to 87.182
   goals met: 0 of 3
8. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 182.54 to 171.08, (fuel-used) from 87.182 to 98.642
   goals met: 0 of 3
9. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 171.08 to 159.62, (fuel-used) from 98.642 to 110.102
   goals met: 0 of 3
10. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 72.278 to 68.35, (fuel-used) from 110.102 to 114.03
   goals met: 0 of 3
11. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 68.35 to 64.422, (fuel-used) from 114.03 to 117.958
   goals met: 0 of 3
12. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 64.422 to 60.494, (fuel-used) from 117.958 to 121.886
   goals met: 0 of 3
13. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 159.62 to 148.16, (fuel-used) from 121.886 to 133.346
   goals met: 0 of 3
14. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 148.16 to 136.7, (fuel-used) from 133.346 to 144.806
   goals met: 0 of 3
15. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 60.494 to 56.566, (fuel-used) from 144.806 to 148.734
   goals met: 0 of 3
16. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 56.566 to 52.638, (fuel-used) from 148.734 to 152.662
   goals met: 0 of 3
17. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 52.638 to 48.71, (fuel-used) from 152.662 to 156.59
   goals met: 0 of 3
18. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 48.71 to 44.782, (fuel-used) from 156.59 to 160.518
   goals met: 0 of 3
19. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 44.782 to 40.854, (fuel-used) from 160.518 to 164.446
   goals met: 0 of 3
20. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 40.854 to 36.926, (fuel-used) from 164.446 to 168.374
   goals met: 0 of 3
21. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 36.926 to 32.998, (fuel-used) from 168.374 to 172.302
   goals met: 0 of 3
22. (turn_to satellite1 star0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 32.998 to 29.07, (fuel-used) from 172.302 to 176.23
   goals met: 0 of 3
23. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 136.7 to 125.24, (fuel-used) from 176.23 to 187.69
   goals met: 0 of 3
24. (turn_to satellite1 planet5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 29.07 to 28.2376, (fuel-used) from 187.69 to 188.522
   goals met: 0 of 3
25. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 3
26. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 125.24 to 113.78, (fuel-used) from 188.522 to 199.982
   goals met: 0 of 3
27. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 3
28. (turn_to satellite1 star0 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 28.2376 to 27.4052, (fuel-used) from 199.982 to 200.815
   goals met: 0 of 3
29. (turn_to satellite1 groundstation1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 27.4052 to 20.0392, (fuel-used) from 200.815 to 208.181
   goals met: 0 of 3
30. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 3
31. (turn_to satellite1 star0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 20.0392 to 12.6732, (fuel-used) from 208.181 to 215.547
   goals met: 0 of 3
32. (turn_to satellite1 planet5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 12.6732 to 11.8408, (fuel-used) from 215.547 to 216.379
   goals met: 0 of 3
33. (take_image satellite1 planet5 instrument3 spectrograph0)
   added: (have_image planet5 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 772, (data-stored) from 0 to 228
   goals met: 1 of 3
34. (turn_to satellite1 star0 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 11.8408 to 11.0084, (fuel-used) from 216.379 to 217.212
   goals met: 1 of 3
35. (turn_to satellite1 planet4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 11.0084 to 7.0804, (fuel-used) from 217.212 to 221.14
   goals met: 1 of 3
36. (turn_to satellite1 planet3 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 7.0804 to 2.0174, (fuel-used) from 221.14 to 226.203
   goals met: 1 of 3
37. (take_image satellite1 planet3 instrument3 thermograph1)
   added: (have_image planet3 thermograph1)
   changed: (data_capacity satellite1) from 772 to 716, (data-stored) from 228 to 284
   goals met: 2 of 3
38. (take_image satellite0 planet6 instrument0 infrared2)
   added: (have_image planet6 infrared2)
   changed: (data_capacity satellite0) from 1000 to 829, (data-stored) from 284 to 455
   goals met: 3 of 3
